blog/20231119-1024.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://www.p-snow.org/config/blog/rss.xml"
      title="RSS feed for https://www.p-snow.org/config/blog">
<title>TempEL, an Emacs package for managing templates</title>
<meta charset="utf-8"><meta http-equiv="X-UA-Compatible" content="IE=edge"><meta name="viewport" content="width=device-width, initial-scale=1.0"><link rel="stylesheet" href="https://cdn.simplecss.org/simple.css"><link rel="stylesheet" href="./assets/css/style.css"></head>
<body>
<div id="preamble" class="status"><header><nav><a href="https://www.p-snow.org">Home</a><a href="https://www.p-snow.org/config/blog/tag-english.html">Posts</a><a href="https://www.p-snow.org/config/blog/tag-japanese.html">日本語記事</a><a href="https://www.p-snow.org/config/blog/about.html">About</a><a href="https://www.p-snow.org/config/blog/rss.xml">RSS</a></nav><h1>.dot life</h1><p>by p-snow</p></header></div>
<div id="content">
<div class="post-date">21 Nov 2023</div><h1 class="post-title"><a href="https://www.p-snow.org/config/blog/20231119-1024.html">TempEL, an Emacs package for managing templates</a></h1>
<p>
<preview>
<a href="https://github.com/joaotavora/yasnippet#start-of-content">YASnippet</a> had been my go-to package until I came across <a href="https://www.reddit.com/r/emacs/comments/yuyqqj/can_tempel_replace_yasnippet/">this thread</a>. Now I'm excited about yet another Emacs template system named "<a href="https://github.com/minad/tempel">TempEL</a>". YASnippet is undoubtedly a great package for handling snippets formatted like in TextMate. The only drawback I often encounter is that the package manages each snippet in a separate file, and acquiring the snippet format can be slightly challenging. TempEL addressed this concern with the 'tempo' format, which has been around in Emacs for decades.
</preview>
</p>

<p>
The following two templates are used to create the same skeleton for a blog post in Org-mode, using YASnippet and TempEL as the respective tools.
</p>

<p>
<details><summary>YASnippet</summary><p>
</p>
<div class="org-src-container">
<pre class="src src-text"># -*- mode: snippet -*-
# name: blog-post
# key: blog
# --
* ${1:blog_title}
SCHEDULED: ${2:`(format-time-string "&lt;%Y-%m-%d %a&gt;")`}
:PROPERTIES:
:EXPORT_FILE_NAME: ${3:`(format-time-string "%Y%m%d_%H%M")`}
:END:
${0:`(org-expiry-insert-created)`}
</pre>
</div>
<p>
</p></details>
</p>

<p>
<details><summary>TempEL</summary><p>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(blog &amp; (org-insert-heading-after-current)
      (p <span style="font-style: italic;">"blog title: "</span> title t) (insert title)
      (<span style="font-weight: bold;">prog1</span> nil (org-schedule nil (current-time)))
      (org-entry-put (point) <span style="font-style: italic;">"EXPORT_FILE_NAME"</span> (format-time-string <span style="font-style: italic;">"%Y%m%d_%H%M"</span>)))
</pre>
</div>
<p>
</p></details>
</p>

<p>
As you can see, the TempEL format allows you to write templates in full Lisp data code, whereas YASnippet's format permits the use of Lisp code to a limited extent, as long as the code does not directly manipulate buffer contents. That's the point I'd like to recommend TempEL to Lispers and Emacs enthusiasts. You can see <a href="https://github.com/p-snow/config/blob/main/dotfiles.org#my-tempel-templates-in-modes">my TempEL templates</a> being incorporated into <a href="https://www.p-snow.org/config/dotfiles.html">my configuration collection</a>.
</p>
<div class="taglist"><a href="https://www.p-snow.org/config/blog/tags.html">Tags</a>: <a href="https://www.p-snow.org/config/blog/tag-emacs.html">emacs</a> <a href="https://www.p-snow.org/config/blog/tag-english.html">english</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
